In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv('ORIGINAL-DATASET.csv')

In [3]:
df

,State,Year,Type_code,Type,Gender,Age_group,Total
0,A & N Islands,2001,Causes,Illness (Aids/STD),Female,0-14,0
1,A & N Islands,2001,Causes,Bankruptcy or Sudden change in Economic,Female,0-14,0
2,A & N Islands,2001,Causes,Cancellation/Non-Settlement of Marriage,Female,0-14,0
3,A & N Islands,2001,Causes,Physical Abuse (Rape/Incest Etc.),Female,0-14,0
4,A & N Islands,2001,Causes,Dowry Dispute,Female,0-14,0
...,...,...,...,...,...,...,...
237514,West Bengal,2012,Social_Status,Seperated,Male,0-100+,149
237515,West Bengal,2012,Social_Status,Widowed/Widower,Male,0-100+,233
237516,West Bengal,2012,Social_Status,Married,Male,0-100+,5451
237517,West Bengal,2012,Social_Status,Divorcee,Male,0-100+,189
237518,West Bengal,2012,Social_Status,Never Married,Male,0-100+,2658

In [4]:
df.sort_values(by='Year', ascending=True)

,State,Year,Type_code,Type,Gender,Age_group,Total
0,A & N Islands,2001,Causes,Illness (Aids/STD),Female,0-14,0
13203,Mizoram,2001,Causes,Unemployment,Male,60+,0
13202,Mizoram,2001,Causes,Professional/Career Problem,Male,60+,0
13201,Mizoram,2001,Causes,Love Affairs,Male,60+,0
13200,Mizoram,2001,Causes,Cancer,Male,60+,0
...,...,...,...,...,...,...,...
224315,Gujarat,2012,Means_adopted,By Jumping from (Other sites),Male,45-59,0
224314,Gujarat,2012,Means_adopted,By Hanging,Male,45-59,220
224313,Gujarat,2012,Means_adopted,By Consuming Insecticides,Male,45-59,278
224320,Gujarat,2012,Means_adopted,By Drowning,Female,60+,8
237518,West Bengal,2012,Social_Status,Never Married,Male,0-100+,2658

In [5]:
Education = df.loc[df['Type_code'] == 'Education_Status']

In [6]:
Education

,State,Year,Type_code,Type,Gender,Age_group,Total
260,A & N Islands,2001,Education_Status,Diploma,Female,0-100+,0
261,A & N Islands,2001,Education_Status,No Education,Female,0-100+,4
262,A & N Islands,2001,Education_Status,Post Graduate and Above,Female,0-100+,0
263,A & N Islands,2001,Education_Status,Middle,Female,0-100+,33
264,A & N Islands,2001,Education_Status,Graduate,Female,0-100+,0
...,...,...,...,...,...,...,...
237234,West Bengal,2012,Education_Status,Primary,Male,0-100+,2983
237235,West Bengal,2012,Education_Status,No Education,Male,0-100+,1096
237236,West Bengal,2012,Education_Status,Middle,Male,0-100+,2467
237237,West Bengal,2012,Education_Status,Graduate,Male,0-100+,242
237238,West Bengal,2012,Education_Status,Matriculate/Secondary,Male,0-100+,1260

In [7]:
Professional = df.loc[df['Type_code'] == 'Professional_Profile']

In [8]:
Professional

,State,Year,Type_code,Type,Gender,Age_group,Total
436,A & N Islands,2001,Professional_Profile,Retired Person,Female,0-14,0
437,A & N Islands,2001,Professional_Profile,Unemployed,Female,0-14,0
438,A & N Islands,2001,Professional_Profile,Public Sector Undertaking,Female,0-14,0
439,A & N Islands,2001,Professional_Profile,Service (Private),Female,0-14,0
440,A & N Islands,2001,Professional_Profile,House Wife,Female,0-14,0
...,...,...,...,...,...,...,...
237504,West Bengal,2012,Professional_Profile,Farming/Agriculture Activity,Male,60+,0
237505,West Bengal,2012,Professional_Profile,Student,Male,60+,0
237506,West Bengal,2012,Professional_Profile,Service (Private),Male,60+,0
237507,West Bengal,2012,Professional_Profile,Professional Activity,Male,60+,0
237508,West Bengal,2012,Professional_Profile,Service (Government),Male,60+,0

In [9]:
Social = df.loc[df['Type_code'] == 'Social_Status']

In [10]:
Social

,State,Year,Type_code,Type,Gender,Age_group,Total
552,A & N Islands,2001,Social_Status,Married,Female,0-100+,38
553,A & N Islands,2001,Social_Status,Seperated,Female,0-100+,0
554,A & N Islands,2001,Social_Status,Widowed/Widower,Female,0-100+,0
555,A & N Islands,2001,Social_Status,Divorcee,Female,0-100+,0
556,A & N Islands,2001,Social_Status,Never Married,Female,0-100+,12
...,...,...,...,...,...,...,...
237514,West Bengal,2012,Social_Status,Seperated,Male,0-100+,149
237515,West Bengal,2012,Social_Status,Widowed/Widower,Male,0-100+,233
237516,West Bengal,2012,Social_Status,Married,Male,0-100+,5451
237517,West Bengal,2012,Social_Status,Divorcee,Male,0-100+,189
237518,West Bengal,2012,Social_Status,Never Married,Male,0-100+,2658

In [11]:
# Education.to_csv('Education.csv', index=False)
# Professional.to_csv('Professional.csv', index=False)
# Social.to_csv('Social.csv', index=False)

In [16]:
Social

,State,Year,Type_code,Type,Gender,Age_group,Total
552,A & N Islands,2001,Social_Status,Married,Female,0-100+,38
553,A & N Islands,2001,Social_Status,Seperated,Female,0-100+,0
554,A & N Islands,2001,Social_Status,Widowed/Widower,Female,0-100+,0
555,A & N Islands,2001,Social_Status,Divorcee,Female,0-100+,0
556,A & N Islands,2001,Social_Status,Never Married,Female,0-100+,12
...,...,...,...,...,...,...,...
237514,West Bengal,2012,Social_Status,Seperated,Male,0-100+,149
237515,West Bengal,2012,Social_Status,Widowed/Widower,Male,0-100+,233
237516,West Bengal,2012,Social_Status,Married,Male,0-100+,5451
237517,West Bengal,2012,Social_Status,Divorcee,Male,0-100+,189
237518,West Bengal,2012,Social_Status,Never Married,Male,0-100+,2658

In [17]:
grp = Social.groupby('Year')

In [27]:
for group in grp:
    print(group)

(2001,                State  Year      Type_code             Type  Gender Age_group  \
552    A & N Islands  2001  Social_Status          Married  Female    0-100+
553    A & N Islands  2001  Social_Status        Seperated  Female    0-100+
554    A & N Islands  2001  Social_Status  Widowed/Widower  Female    0-100+
555    A & N Islands  2001  Social_Status         Divorcee  Female    0-100+
556    A & N Islands  2001  Social_Status    Never Married  Female    0-100+
...              ...   ...            ...              ...     ...       ...
19792    West Bengal  2001  Social_Status          Married    Male    0-100+
19793    West Bengal  2001  Social_Status         Divorcee    Male    0-100+
19794    West Bengal  2001  Social_Status  Widowed/Widower    Male    0-100+
19795    West Bengal  2001  Social_Status    Never Married    Male    0-100+
19796    West Bengal  2001  Social_Status        Seperated    Male    0-100+

       Total
552       38
553        0
554        0
555        0
556       12
...      ...
19792   4385
19793    337
19794    432
19795   2028
19796    313

[380 rows x 7 columns])
(2002,                State  Year      Type_code             Type  Gender Age_group  \
20344  A & N Islands  2002  Social_Status    Never Married  Female    0-100+
20345  A & N Islands  2002  Social_Status        Seperated  Female    0-100+
20346  A & N Islands  2002  Social_Status         Divorcee  Female    0-100+
20347  A & N Islands  2002  Social_Status          Married  Female    0-100+
20348  A & N Islands  2002  Social_Status  Widowed/Widower  Female    0-100+
...              ...   ...            ...              ...     ...       ...
39582    West Bengal  2002  Social_Status        Seperated    Male    0-100+
39583    West Bengal  2002  Social_Status  Widowed/Widower    Male    0-100+
39584    West Bengal  2002  Social_Status    Never Married    Male    0-100+
39585    West Bengal  2002  Social_Status          Married    Male    0-100+
39586    West Bengal  2002  Social_Status         Divorcee    Male    0-100+

       Total
20344     17
20345      0
20346      0
20347     36
20348      0
...      ...
39582    165
39583    446
39584   2057
39585   4266
39586    190

[380 rows x 7 columns])
(2003,                State  Year      Type_code             Type  Gender Age_group  \
40133  A & N Islands  2003  Social_Status         Divorcee  Female    0-100+
40134  A & N Islands  2003  Social_Status  Widowed/Widower  Female    0-100+
40135  A & N Islands  2003  Social_Status          Married  Female    0-100+
40136  A & N Islands  2003  Social_Status        Seperated  Female    0-100+
40137  A & N Islands  2003  Social_Status    Never Married  Female    0-100+
...              ...   ...            ...              ...     ...       ...
59368    West Bengal  2003  Social_Status         Divorcee    Male    0-100+
59369    West Bengal  2003  Social_Status        Seperated    Male    0-100+
59370    West Bengal  2003  Social_Status          Married    Male    0-100+
59371    West Bengal  2003  Social_Status    Never Married    Male    0-100+
59372    West Bengal  2003  Social_Status  Widowed/Widower    Male    0-100+

       Total
40133      0
40134      0
40135     28
40136      0
40137     15
...      ...
59368    109
59369    101
59370   4980
59371   1952
59372    282

[380 rows x 7 columns])
(2004,                State  Year      Type_code             Type  Gender Age_group  \
59923  A & N Islands  2004  Social_Status    Never Married  Female    0-100+
59924  A & N Islands  2004  Social_Status          Married  Female    0-100+
59925  A & N Islands  2004  Social_Status        Seperated  Female    0-100+
59926  A & N Islands  2004  Social_Status  Widowed/Widower  Female    0-100+
59927  A & N Islands  2004  Social_Status         Divorcee  Female    0-100+
...              ...   ...            ...              ...     ...       ...
79151    West Bengal  2004  Social_Status        Seperated    Male    0-100+
79152    West Bengal  2004  Social_Status         Divorcee    Male    0-100+
79153    West Bengal  2004  Social_Status          Married    Male    0-100+
79154    West Bengal  2004  Social_Status  Widowed/Widower    Male    0-100+
79155    West Bengal  2004  Social_Status    Never Married    Male    0-100+

       Total
59923     15
59924     26
59925      0
59926      0
59927      0
...      ...
79151    320
79152    139
79153   4854
79154    264
79155   2084

[380 rows x 7 columns])
(2005,                State  Year      Type_code             Type  Gender Age_group  \
79704  A & N Islands  2005  Social_Status          Married  Female    0-100+
79705  A & N Islands  2005  Social_Status         Divorcee  Female    0-100+
79706  A & N Islands  2005  Social_Status    Never Married  Female    0-100+
79707  A & N Islands  2005  Social_Status        Seperated  Female    0-100+
79708  A & N Islands  2005  Social_Status  Widowed/Widower  Female    0-100+
...              ...   ...            ...              ...     ...       ...
98954    West Bengal  2005  Social_Status    Never Married    Male    0-100+
98955    West Bengal  2005  Social_Status  Widowed/Widower    Male    0-100+
98956    West Bengal  2005  Social_Status         Divorcee    Male    0-100+
98957    West Bengal  2005  Social_Status        Seperated    Male    0-100+
98958    West Bengal  2005  Social_Status          Married    Male    0-100+

       Total
79704     35
79705      0
79706     18
79707      0
79708      0
...      ...
98954   1934
98955    254
98956    142
98957    274
98958   6010

[380 rows x 7 columns])
(2006,                 State  Year      Type_code             Type  Gender Age_group  \
99508   A & N Islands  2006  Social_Status    Never Married  Female    0-100+
99509   A & N Islands  2006  Social_Status          Married  Female    0-100+
99510   A & N Islands  2006  Social_Status         Divorcee  Female    0-100+
99511   A & N Islands  2006  Social_Status  Widowed/Widower  Female    0-100+
99512   A & N Islands  2006  Social_Status        Seperated  Female    0-100+
...               ...   ...            ...              ...     ...       ...
118740    West Bengal  2006  Social_Status    Never Married    Male    0-100+
118741    West Bengal  2006  Social_Status         Divorcee    Male    0-100+
118742    West Bengal  2006  Social_Status  Widowed/Widower    Male    0-100+
118743    West Bengal  2006  Social_Status        Seperated    Male    0-100+
118744    West Bengal  2006  Social_Status          Married    Male    0-100+

        Total
99508      10
99509      27
99510       0
99511       0
99512       0
...       ...
118740   1650
118741    126
118742    303
118743    108
118744   6933

[380 rows x 7 columns])
(2007,                 State  Year      Type_code             Type  Gender Age_group  \
119295  A & N Islands  2007  Social_Status         Divorcee  Female    0-100+
119296  A & N Islands  2007  Social_Status          Married  Female    0-100+
119297  A & N Islands  2007  Social_Status        Seperated  Female    0-100+
119298  A & N Islands  2007  Social_Status  Widowed/Widower  Female    0-100+
119299  A & N Islands  2007  Social_Status    Never Married  Female    0-100+
...               ...   ...            ...              ...     ...       ...
138534    West Bengal  2007  Social_Status    Never Married    Male    0-100+
138535    West Bengal  2007  Social_Status          Married    Male    0-100+
138536    West Bengal  2007  Social_Status  Widowed/Widower    Male    0-100+
138537    West Bengal  2007  Social_Status         Divorcee    Male    0-100+
138538    West Bengal  2007  Social_Status        Seperated    Male    0-100+

        Total
119295      0
119296     33
119297      0
119298      0
119299     23
...       ...
138534   2154
138535   5637
138536    291
138537     75
138538    348

[380 rows x 7 columns])
(2008,                 State  Year      Type_code             Type  Gender Age_group  \
139089  A & N Islands  2008  Social_Status    Never Married  Female    0-100+
139090  A & N Islands  2008  Social_Status         Divorcee  Female    0-100+
139091  A & N Islands  2008  Social_Status          Married  Female    0-100+
139092  A & N Islands  2008  Social_Status        Seperated  Female    0-100+
139093  A & N Islands  2008  Social_Status  Widowed/Widower  Female    0-100+
...               ...   ...            ...              ...     ...       ...
158331    West Bengal  2008  Social_Status        Seperated    Male    0-100+
158332    West Bengal  2008  Social_Status    Never Married    Male    0-100+
158333    West Bengal  2008  Social_Status         Divorcee    Male    0-100+
158334    West Bengal  2008  Social_Status  Widowed/Widower    Male    0-100+
158335    West Bengal  2008  Social_Status          Married    Male    0-100+

        Total
139089     12
139090      0
139091     33
139092      0
139093      0
...       ...
158331     93
158332   2844
158333     78
158334    172
158335   5182

[380 rows x 7 columns])
(2009,                 State  Year      Type_code             Type  Gender Age_group  \
158887  A & N Islands  2009  Social_Status          Married  Female    0-100+
158888  A & N Islands  2009  Social_Status    Never Married  Female    0-100+
158889  A & N Islands  2009  Social_Status         Divorcee  Female    0-100+
158890  A & N Islands  2009  Social_Status        Seperated  Female    0-100+
158891  A & N Islands  2009  Social_Status  Widowed/Widower  Female    0-100+
...               ...   ...            ...              ...     ...       ...
178117    West Bengal  2009  Social_Status    Never Married    Male    0-100+
178118    West Bengal  2009  Social_Status        Seperated    Male    0-100+
178119    West Bengal  2009  Social_Status  Widowed/Widower    Male    0-100+
178120    West Bengal  2009  Social_Status          Married    Male    0-100+
178121    West Bengal  2009  Social_Status         Divorcee    Male    0-100+

        Total
158887     28
158888     17
158889      0
158890      0
158891      0
...       ...
178117   2580
178118    127
178119    190
178120   5521
178121     76

[380 rows x 7 columns])
(2010,                 State  Year      Type_code             Type  Gender Age_group  \
178671  A & N Islands  2010  Social_Status        Seperated  Female    0-100+
178672  A & N Islands  2010  Social_Status          Married  Female    0-100+
178673  A & N Islands  2010  Social_Status    Never Married  Female    0-100+
178674  A & N Islands  2010  Social_Status         Divorcee  Female    0-100+
178675  A & N Islands  2010  Social_Status  Widowed/Widower  Female    0-100+
...               ...   ...            ...              ...     ...       ...
197909    West Bengal  2010  Social_Status          Married    Male    0-100+
197910    West Bengal  2010  Social_Status        Seperated    Male    0-100+
197911    West Bengal  2010  Social_Status         Divorcee    Male    0-100+
197912    West Bengal  2010  Social_Status    Never Married    Male    0-100+
197913    West Bengal  2010  Social_Status  Widowed/Widower    Male    0-100+

        Total
178671      0
178672     31
178673     11
178674      0
178675      2
...       ...
197909   5938
197910    173
197911     65
197912   2941
197913    184

[380 rows x 7 columns])
(2011,                 State  Year      Type_code             Type  Gender Age_group  \
198465  A & N Islands  2011  Social_Status        Seperated  Female    0-100+
198466  A & N Islands  2011  Social_Status          Married  Female    0-100+
198467  A & N Islands  2011  Social_Status    Never Married  Female    0-100+
198468  A & N Islands  2011  Social_Status         Divorcee  Female    0-100+
198469  A & N Islands  2011  Social_Status  Widowed/Widower  Female    0-100+
...               ...   ...            ...              ...     ...       ...
217715    West Bengal  2011  Social_Status        Seperated    Male    0-100+
217716    West Bengal  2011  Social_Status  Widowed/Widower    Male    0-100+
217717    West Bengal  2011  Social_Status         Divorcee    Male    0-100+
217718    West Bengal  2011  Social_Status    Never Married    Male    0-100+
217719    West Bengal  2011  Social_Status          Married    Male    0-100+

        Total
198465      0
198466     26
198467     15
198468      1
198469      0
...       ...
217715    267
217716    251
217717     61
217718   2973
217719   6072

[380 rows x 7 columns])
(2012,                 State  Year      Type_code             Type  Gender Age_group  \
218269  A & N Islands  2012  Social_Status    Never Married  Female    0-100+
218270  A & N Islands  2012  Social_Status         Divorcee  Female    0-100+
218271  A & N Islands  2012  Social_Status        Seperated  Female    0-100+
218272  A & N Islands  2012  Social_Status  Widowed/Widower  Female    0-100+
218273  A & N Islands  2012  Social_Status          Married  Female    0-100+
...               ...   ...            ...              ...     ...       ...
237514    West Bengal  2012  Social_Status        Seperated    Male    0-100+
237515    West Bengal  2012  Social_Status  Widowed/Widower    Male    0-100+
237516    West Bengal  2012  Social_Status          Married    Male    0-100+
237517    West Bengal  2012  Social_Status         Divorcee    Male    0-100+
237518    West Bengal  2012  Social_Status    Never Married    Male    0-100+

        Total
218269     11
218270      0
218271      0
218272      0
218273     30
...       ...
237514    149
237515    233
237516   5451
237517    189
237518   2658

[380 rows x 7 columns])

In [26]:
df = grp.get_group(2001) 

print(type(df))

<class 'pandas.core.frame.DataFrame'>